export const CATEGORY_MESSAGES = {
  NOT_FOUND: 'Категорію не знайдено',
  PARENT_NOT_FOUND: 'Батьківську категорію не знайдено',
  PARENT_OTHER_SHOP: 'Батьківська категорія належить іншому магазину',
  SELF_PARENT: 'Категорія не може бути батьківською сама для себе',
  ALREADY_FIRST: 'Категорія вже на початку',
  ALREADY_LAST: 'Категорія вже в кінці',
  REMOVED: 'Категорію успішно видалено',
  DUPLICATE_SLUG: 'Слаг категорії вже існує для цього магазину',
  DUPLICATE_SLUG_IN_PARENT:
    'Слаг категорії вже існує для цього магазину та батьківської категорії',
  OTHER_SHOP: 'Категорія належить іншому магазину, ніж продукт',
} as const;
